// src/database/daybaseData.ts
export const daybaseData = [
    {
        house: 'อัตตะ',
        thai_name: 'อัตตะ',
        description: 'ตัวตนของเจ้าชะตา เป็นพื้นฐานนิสัย อุปนิสัยใจคอ รูปร่างหน้าตา สุขภาพ และวิถีชีวิตโดยรวม',
        base: 1
    },
    {
        house: 'หินะ',
        thai_name: 'หินะ',
        description: 'ความต่ำต้อย ความสิ้นสุด อุปสรรค ความผิดพลาด หรือสิ่งที่จะทำให้ชีวิตตกต่ำ ภพนี้ยังรวมถึงโรคภัยไข้เจ็บและสิ่งที่ต้องแก้ไข',
        base: 1
    },
    {
        house: 'ธนัง',
        thai_name: 'ธะนัง',
        description: 'ทรัพย์สิน เงินทอง และความมั่งคั่ง เป็นภพที่บอกถึงฐานะทางการเงินและรายได้ของเจ้าชะตา',
        base: 1
    },
    {
        house: 'ปิตา',
        thai_name: 'ปิตา',
        description: 'บิดา หรือผู้ใหญ่เพศชายที่ให้การอุปถัมภ์ เป็นภพที่เกี่ยวกับผู้หลักผู้ใหญ่ที่คอยให้การสนับสนุน',
        base: 1
    },
    {
        house: 'มาตา',
        thai_name: 'มาตา',
        description: 'มารดา หรือผู้ใหญ่เพศหญิงที่ให้การอุปถัมภ์ เป็นภพที่เกี่ยวกับผู้หลักผู้ใหญ่เพศหญิงที่คอยให้การสนับสนุน',
        base: 1
    },
    {
        house: 'โภคา',
        thai_name: 'โภคา',
        description: 'ทรัพย์สิน ที่เป็นอสังหาริมทรัพย์ เช่น ที่ดิน บ้าน หรือทรัพย์สินที่จับต้องได้และเคลื่อนย้ายยาก เป็นสิ่งที่ทำให้เกิดความมั่นคง',
        base: 1
    },
    {
        house: 'มัชฌิมา',
        thai_name: 'มัชฌิมา',
        description: 'ความปานกลาง หรือความเป็นกลาง เป็นภพที่แสดงถึงเรื่องราวที่ไม่ได้ดีหรือร้ายจนเกินไป มักจะเกี่ยวกับการเดินทางและการผันแปรของชีวิต',
        base: 1
    }
];