// src/database/eightbaseData.ts
export const eightbaseData = [
    {
        house: 'อาตมา',
        thai_name: 'อาตมา',
        description: 'เคารพกันและกัน ถ้อยที่ถ้อยอาศัยกัน ช่วยกันสร้างรายได้',
        base: 8
    },
    {
        house: 'หินะ',
        thai_name: 'หินะ',
        description: 'มักเจ้าอารมณ์ เอาแต่ใจตนเอง จุ๊กจิ๊กเรื่องภายในบ้านเรื่องเงิน มักเกิดปากเสียงเถียงกันบ่อย',
        base: 8
    },
    {
        house: 'สิทธิโชค',
        thai_name: 'สิทธิโชค',
        description: 'ถ้าฐานะคู่ต่ำ คู่หวังสบาย ถ้าฐานเท่ากัน ก็ช่วยกันสร้างทรัพย์',
        base: 8
    },
    {
        house: 'โภคทรัพย์',
        thai_name: 'โภคทรัพย์',
        description: 'ช่วยกันทำมาหากินไม่เห็นแก่เหน็ดเหนื่อย',
        base: 8
    },
    {
        house: 'มหาโจร',
        thai_name: 'มหาโจร',
        description: 'เอาแต่ใจตัวเอง ล้างผลาญ ไม่สบอารมณ์หนีห่าง แตกร้าววิวาท',
        base: 8
    },
    {
        house: 'อุบาทว์',
        thai_name: 'อุบาทว์',
        description: 'ใช้เงินเก่ง ชอบแต่งตัว อวดโก้เกินฐานะ สร้างหนี้ ชอบการพนัน',
        base: 8
    },
    {
        house: 'อุปถัมภ์',
        thai_name: 'อุปถัมภ์',
        description: 'รู้จักเก็บออม ต่อสู้อุปสรรคร่วมกัน เห็นใจถนอมน้ำใจกัน',
        base: 8
    },
];