// src/database/monthbaseData.ts
export const monthbaseData = [
    {
        house: 'ตนุ',
        thai_name: 'ตนุ',
        description: 'ตัวตน ของเจ้าชะตา เป็นบุคลิกภาพที่แสดงออกภายนอก เป็นรูปร่างหน้าตาและลักษณะนิสัยที่ผู้อื่นมองเห็น',
        base: 2
    },
    {
        house: 'กดุมภะ',
        thai_name: 'กดุมภะ',
        description: 'การเงิน หรือความสามารถในการสร้างรายได้ ภพนี้บอกถึงแนวโน้มการบริหารจัดการทรัพย์สิน',
        base: 2
    },
    {
        house: 'สหัชชะ',
        thai_name: 'สหัชชะ',
        description: 'เพื่อนฝูง และสังคม การเดินทางใกล้ ๆ หรือการติดต่อสื่อสารกับคนรอบข้าง',
        base: 2
    },
    {
        house: 'พันธุ',
        thai_name: 'พันธุ',
        description: 'บ้าน ครอบครัว และที่อยู่อาศัย เป็นความมั่นคงทางจิตใจและทรัพย์สินที่เกี่ยวข้องกับครอบครัว',
        base: 2
    },
    {
        house: 'ปุตตะ',
        thai_name: 'ปุตตะ',
        description: 'บุตร ความรัก การลงทุน หรือความคิดสร้างสรรค์ที่เกิดจากตัวตน',
        base: 2
    },
    {
        house: 'อริ',
        thai_name: 'อริ',
        description: 'ศัตรู อุปสรรค และโรคภัยไข้เจ็บที่อาจเกิดขึ้น ภพนี้ยังรวมถึงหนี้สินและปัญหาต่าง ๆ',
        base: 2
    },
    {
        house: 'ปัตนิ',
        thai_name: 'ปัตนิ',
        description: 'คู่ครอง หุ้นส่วน หรือความสัมพันธ์ที่ต้องร่วมมือกับผู้อื่น',
        base: 2
    },
];