// src/database/ninebaseData.ts
export const ninebaseData = [
    {
        house: 'อัตตะ',
        thai_name: 'อัตตะ',
        description: 'ผลลัพธ์ในการครองเรือนดีร้าย สุดแต่พระเคราะห์ประกอบ',
        base: 9
    },
    {
        house: 'สักกะ',
        thai_name: 'สักกะ',
        description: 'ฉลาด รักก้าวหน้า แม้รวยก็ไม่ยอมวางมือ ชอบการสังคม ผู้อื่นทำงานแทนมักไม่ถูกใจ ต้องเหนื่อยทำเอง',
        base: 9
    },
    {
        house: 'ญาติ',
        thai_name: 'ญาติ',
        description: 'ห่วงใยกัน ถ้าบาปเคราะห์ก็จักเดือดร้อนเพราะญาติตนหรือญาติสามี ถ้ามีบ้านของตัวเองอยู่ไกลญาติดีกว่า',
        base: 9
    },
    {
        house: 'ธนัง',
        thai_name: 'ธะนัง',
        description: 'ช่วยกันหาผลประโยชน์ เร่งทำกิจการให้เกิดผล ชอบทำบุญ',
        base: 9
    },
    {
        house: 'เคหัง',
        thai_name: 'เคหัง',
        description: 'เป็นแม่บ้าน มุ่งหวังจะมีที่ดินบ้านของตน รักบ้านรักครอบครัว',
        base: 9
    },
    {
        house: 'นาวัง',
        thai_name: 'นาวัง',
        description: 'คู่ต่างถิ่น ต่างประเทศ ทำการค้า หาบเร่แผงลอย ห่างกันเพราะงานอยู่คนละบ้าน',
        base: 9
    },
    {
        house: 'ภริยัง',
        thai_name: 'ภริยัง',
        description: 'หยิ่งในการครองเรือนร่วมกัน ดีร้ายสุดแต่ดาวพระเคราะห์',
        base: 9
    },
];