export const prajomklawData = [
    {
        remainder: 1,
        verse: `เศษ 1 เสาเรือนไฟไหม้ ชะตาร้ายทั้งชายหญิง
ไร้เรือนที่พึ่งพิง ที่พึ่งพักสำนักเนา
จะร่อนเร่ระเหระหน เร่งเจียมตนอย่าดูเบา
เพราะว่าชะตาเรา โทษประกอบจึงเกิดกรรม`
    },
    {
        remainder: 2,
        verse: `เศษ 2 จะครองไข้ มีโรคภัยสิงประจำ
หยูกยาจะหาทำ บ่ถูกแท้จนแก่ตาย`
    },
    {
        remainder: 3,
        verse: `เศษ 3 ความสบาย มีข้าควายและเกวียนวัว
พอสมสกุลตัว เท่าที่ทายสถานกลาง`
    },
    {
        remainder: 4,
        verse: `เศษ 4 มีข้าครอก อเนกนอกคนานาง
อุปถัมภ์ล้วนสำอาง บ่ไข้ชุกบ่ทุกข์เป็น`
    },
    {
        remainder: 5,
        verse: `เศษ 5 ชะตากลับ ทุนทรัพย์จะแสนเข็ญ
ภายหลังชะตาเป็น ทุนทรัพย์นับอนันต์`
    },
    {
        remainder: 6,
        verse: `เศษ 6 จะยกญาติ เป็นเชื้อชาติประเสริฐสรรค์
เงินตรายศถาพลัน ทุนทรัพย์ลำดับมี`
    },
    {
        remainder: 7,
        verse: `เศษ 7 นั้นผ้าขาด จะนุ่งห่มก็เต็มที
ภัตราย่อมราคี ระคายคับทั้งทรัพย์สิน`
    },
    {
        remainder: 8,
        verse: `เศษ 8 จะเปรื่องยศ จะปรากฏในแผ่นดิน
ทรัพย์ศฤงคารสถานถิ่น ทั้งอำนาจและวาสนา`
    },
    {
        remainder: 9,
        verse: `เศษ 9 กินข้าวกลางตลาด เสมอชาติสุนัขา
ถึงจะมีวาสนา ต้องประกอบทำงานการ
เปรียบตระกูลวณิพก ถึงต่ำตกก็บ่นาน
ดั่งนักเลงสุราบาน พอขวนขวายใส่ท้องตน`
    },
    {
        remainder: 0,
        verse: `เศษ 10 (0) ดังนกแขกเต้า ทำรวงรังไว้บังฝน
แสวงดีย่อมมีผล อย่าคลุกเคล้ากับเหล่าพาล
เหมือนปักษีอันมีปีก รู้หลบหลีกธนูพราน
ถ้าประมาทจะเสียการ ถึงชอกช้ำระกำกาย`
    }
];
