// src/data/zodiacSignsData.ts

export const zodiacSignsData = [
    {
        year: "ชวด",
        animal: "หนู",
        character: "เป็นคนฉลาด มีไหวพริบดี สามารถปรับตัวได้เก่ง มีเสน่ห์และเป็นคนคิดเร็วทำเร็ว"
    },
    {
        year: "ฉลู",
        animal: "วัว",
        character: "เป็นคนหนักแน่น อดทน มีความรับผิดชอบสูง มีความซื่อสัตย์และพึ่งพาได้ แต่บางครั้งอาจจะดื้อรั้น"
    },
    {
        year: "ขาล",
        animal: "เสือ",
        character: "มีความกล้าหาญ มั่นใจในตัวเอง มีความเป็นผู้นำสูง กระตือรือร้น แต่ก็อาจจะใจร้อนและทำอะไรรวดเร็วเกินไป"
    },
    {
        year: "เถาะ",
        animal: "กระต่าย",
        character: "เป็นคนอ่อนโยน สุภาพเรียบร้อย มีเสน่ห์ในด้านการเข้าสังคม และรักความสงบ แต่ก็อาจจะมีความลังเลและอ่อนไหวง่าย"
    },
    {
        year: "มะโรง",
        animal: "มังกร",
        character: "เป็นคนทะเยอทะยาน มีพลังงานสูง มั่นใจในตัวเอง และมีบุคลิกโดดเด่น แต่บางครั้งอาจจะดูหยิ่งและต้องการเป็นศูนย์กลาง"
    },
    {
        year: "มะเส็ง",
        animal: "งู",
        character: "ฉลาดหลักแหลม มีไหวพริบ และมีสัญชาตญาณที่ดี เป็นคนมีเสน่ห์ลึกลับ แต่ก็เป็นคนใจแข็งและระมัดระวังตัวสูง"
    },
    {
        year: "มะเมีย",
        animal: "ม้า",
        character: "เป็นคนรักอิสระ มีชีวิตชีวา ชอบการผจญภัย และมีความกระตือรือร้นสูง แต่ก็อาจจะทำอะไรตามใจตัวเองและขาดความอดทน"
    },
    {
        year: "มะแม",
        animal: "แพะ",
        character: "เป็นคนอ่อนโยน มีความคิดสร้างสรรค์สูง รักความสงบและมีน้ำใจ แต่บางครั้งก็อาจจะขาดความมั่นใจในตัวเอง"
    },
    {
        year: "วอก",
        animal: "ลิง",
        character: "เป็นคนฉลาดแกมโกง มีความคิดสร้างสรรค์ ชอบเข้าสังคม และมีไหวพริบดี แต่ก็อาจจะซุกซนและไม่ชอบอยู่นิ่ง"
    },
    {
        year: "ระกา",
        animal: "ไก่",
        character: "เป็นคนขยันขันแข็ง มีความรับผิดชอบสูง มีระเบียบวินัย แต่ก็อาจจะดูจู้จี้จุกจิกและตรงไปตรงมาจนเกินไป"
    },
    {
        year: "จอ",
        animal: "สุนัข",
        character: "ซื่อสัตย์ จริงใจ และน่าเชื่อถือ เป็นคนมีคุณธรรมสูง แต่ก็อาจจะขี้ระแวงและค่อนข้างกังวล"
    },
    {
        year: "กุน",
        animal: "หมู",
        character: "เป็นคนมีน้ำใจ ซื่อตรง และมองโลกในแง่ดี ชอบความเรียบง่ายและมีความสุขกับเรื่องเล็ก ๆ น้อย ๆ แต่ก็อาจจะถูกหลอกได้ง่าย"
    },
];